In [1]:
import pandas as pd

In [3]:
course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']
duration = [2,3,6,4]
df = pd.DataFrame(data = {'course_name' : course_name, 'duration': duration})

In [4]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [15]:
# Q1. Write a code to print the data present in the second row of the dataframe, df.
df[2:3]

  course_name  duration
2    Big Data         6

In [16]:
df[['course_name','duration']][2:3]

  course_name  duration
2    Big Data         6

In [ ]:
"""
Q2. What is the difference between the functions loc and iloc in pandas.DataFrame?

Ans: 
1. loc() : loc function fetch data from dataframe based on name of column. 
2. iloc(): iloc function detch data from dataframe based on index of dataframe.

"""

In [19]:
#loc function().

df.loc[0:1,['course_name','duration']]

        course_name  duration
0      Data Science         2
1  Machine Learning         3

In [24]:
#iloc function
df.iloc[0:2,[0,1]]

        course_name  duration
0      Data Science         2
1  Machine Learning         3

In [ ]:
"""
Q3. Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_df
then find the output for both new_df.loc[2] and new_df.iloc[2].
"""

In [29]:
new_df=df.reindex(index=[3,0,1,2])

In [30]:
new_df

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [31]:
new_df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [32]:
new_df.iloc[2]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

In [ ]:
"""
Did you observe any difference in both the outputs? If so then explain it.
Ans: yes, loc() fetch data based on reindex , but iloc() still fetch data on actual index.
"""

In [37]:
import pandas as pd
import numpy as np

In [38]:
columns=['column_1','column_2','column_3','column_4','column_5','column_6' ]

In [39]:
indices = [1,2,3,4,5,6]

In [41]:
df1=pd.DataFrame(np.random.rand(6,6), columns=columns, index=indices)

In [42]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.044490  0.641783  0.077031  0.035036  0.667964  0.291019
2  0.895710  0.236951  0.193405  0.389957  0.590252  0.902394
3  0.686983  0.072266  0.924581  0.541335  0.286700  0.811447
4  0.800580  0.003787  0.711278  0.094182  0.759980  0.650705
5  0.424780  0.657849  0.827602  0.809094  0.365160  0.576923
6  0.657900  0.838669  0.756554  0.327410  0.176627  0.355852

In [43]:
# Q4. Write a code to find the following statistical measurements for the above dataframe df1:

In [59]:
# (i) mean of each and every column present in the datafram.

In [64]:
df1.mean()

column_1    0.585074
column_2    0.408551
column_3    0.581742
column_4    0.366169
column_5    0.474447
column_6    0.598057
dtype: float64

In [65]:
# (ii) standard deviation of column, ‘column_2’

In [66]:
df1.std()

column_1    0.308724
column_2    0.348688
column_3    0.355208
column_4    0.287249
column_5    0.231637
column_6    0.242615
dtype: float64

In [ ]:
"""
Q5. Replace the data present in the second row of column, ‘column_2’ by a string variable then find the
mean of column, column_2.
If you are getting errors in executing it then explain why.
[Hint: To replace the data use df1.loc[] and equate this to string data of your choice.]
Ans: 
"""

In [ ]:
"""
Q6. What do you understand about the windows function in pandas and list the types of windows
functions?

Ans: pandas windows function where the input values are taken from a window of one or more rows in a series or table
     and calculation is performed over them.
     The word windows menas number of rows between the two boundaries by we perfrom calculation.
     
     Types of Windows function are: 
     1. Aggregate.
     2. Ranking.
     3. Value.
"""

In [ ]:
"""
Q7. Write a code to print only the current month and year at the time of answering this question.
[Hint: Use pandas.datetime function]
"""

In [10]:
from datetime import date
import pandas as pd

In [8]:
current=date.today()

In [9]:
current

datetime.date(2023, 3, 14)

In [29]:
type(current)

datetime.date

In [30]:
ind=[0]
df1=pd.DataFrame({
    'date':[current]
})

In [31]:
df1

         date
0  2023-03-14

In [37]:
year=pd.DatetimeIndex(df1['date']).year
month=pd.DatetimeIndex(df1['date']).month

In [39]:
print(year)

Int64Index([2023], dtype='int64', name='date')

In [40]:
print(month)

Int64Index([3], dtype='int64', name='date')

In [ ]:
"""
Q8. Write a Python program that takes in two dates as input (in the format YYYY-MM-DD) and
calculates the difference between them in days, hours, and minutes using Pandas time delta. The
program should prompt the user to enter the dates and display the result.
"""

In [42]:
str(datetime.datetime.now())

'2023-03-14 14:01:14.706144'

In [ ]:
y=int(input("Enter month"))
m=int(input("Enter month"))
d=int(input("Enter days"))
h=int(input("Enter hour"))
m=int(input("Enter minute"))
s=int(input("Enter second"))
pd.Timedelta()

In [ ]:
"""
Q11. You are given a CSV file containing student data that includes the student ID and their test score. Write
a Python program that reads the CSV file, calculates the mean, median, and mode of the test scores, and
displays the results in a table.
"""

In [62]:
df1=pd.DataFrame({
    'student':['abishek', "subash", 'shambu', 'rishav', 'bhanu', 'navin'],
    'math': [11,34,54,76,77,23],
    'science':[13,53,65,77,98,12], 
    'English': [12,23,54,65,54,12]
}, index=[101, 102, 103, 104, 105, 106])

In [63]:
df1

     student  math  science  English
101  abishek    11       13       12
102   subash    34       53       23
103   shambu    54       65       54
104   rishav    76       77       65
105    bhanu    77       98       54
106    navin    23       12       12

In [67]:
df1.to_csv('student_marksheet.csv', index=False)

In [14]:
#df1=pd.read_csv('work/Pandas_work/student_marksheet.csv')
df1=pd.read_csv('student_marksheet.csv')

In [69]:
df1

   student  math  science  English
0  abishek    11       13       12
1   subash    34       53       23
2   shambu    54       65       54
3   rishav    76       77       65
4    bhanu    77       98       54
5    navin    23       12       12

In [87]:
df1['avg_mark']=df1[['math','science','English']].mean(axis=1)

In [88]:
df1

   student  math  science  English  mean   avg_mark  median  mode
0  abishek    11       13       12   NaN  12.000000    12.0    12
1   subash    34       53       23   NaN  36.666667    34.0    34
2   shambu    54       65       54   NaN  57.666667    54.0    54
3   rishav    76       77       65   NaN  72.666667    76.0    76
4    bhanu    77       98       54   NaN  76.333333    77.0    77
5    navin    23       12       12   NaN  15.666667    12.0    12

In [82]:
df1['median']=df1[['math','science','English']].median(axis=1)

In [83]:
df1

   student  math  science  English  mean   avg_mark  median
0  abishek    11       13       12   NaN  12.000000    12.0
1   subash    34       53       23   NaN  36.666667    34.0
2   shambu    54       65       54   NaN  57.666667    54.0
3   rishav    76       77       65   NaN  72.666667    76.0
4    bhanu    77       98       54   NaN  76.333333    77.0
5    navin    23       12       12   NaN  15.666667    12.0

In [85]:
df1['mode']=df1.mode(axis=1)

In [86]:
df1

   student  math  science  English  mean   avg_mark  median  mode
0  abishek    11       13       12   NaN  12.000000    12.0    12
1   subash    34       53       23   NaN  36.666667    34.0    34
2   shambu    54       65       54   NaN  57.666667    54.0    54
3   rishav    76       77       65   NaN  72.666667    76.0    76
4    bhanu    77       98       54   NaN  76.333333    77.0    77
5    navin    23       12       12   NaN  15.666667    12.0    12

In [ ]:
"""
Q9. Write a Python program that reads a CSV file containing categorical data and converts a specified
column to a categorical data type. The program should prompt the user to enter the file path, column
name, and category order, and then display the sorted data.
"""

In [30]:
# path=input("Enter path of csv file")
df1=pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')
# column=input('Enter column name to convert into category.')

In [20]:
df1.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [21]:
df1.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [22]:
df1['Sex_dcategory']=df1['column'].astype('category')

In [25]:
df1.dtypes

PassengerId         int64
Survived            int64
Pclass              int64
Name               object
Sex                object
Age               float64
SibSp               int64
Parch               int64
Ticket             object
Fare              float64
Cabin              object
Embarked           object
Sex_dcategory    category
dtype: object

In [ ]:
"""
Q10. Write a Python program that reads a CSV file containing sales data for different products and
visualizes the data using a stacked bar chart to show the sales of each product category over time. The
program should prompt the user to enter the file path and display the chart.
"""

In [31]:
sales=[50, 100, 70, 120, 150]
time=[2012, 2014, 2015, 2016, 2018]

In [35]:
product=['apple', 'dell', 'hp','asus', 'lenvo']

In [37]:
df2=pd.DataFrame({'Time': time,
                  'sales':sales,
                 }, index=product)

NameError: name 'time' is not defined